## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (config refers to values not yet known)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = (known after apply)
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns will be created
+   resource "google_service_account_key" "external-dns" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
+       public_key         = (known after apply)
+       public_key_type    = "TYPE_X509_PEM_FILE"
+       service_account_id = (known after apply)
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # helm_release.cert-manager will be created
+   resource "helm_release" "cert-manager" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "v1.5.3"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "createCustomResource"
+           value = "true"
        }
+       set {
+           name  = "installCRDs"
+           value = "true"
        }
    }

  # helm_release.cinema will be created
+   resource "helm_release" "cinema" {
+       atomic                     = false
+       chart                      = "../charts/cinema"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cinema"
+       namespace                  = "cinema"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "0.2.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "mongodb.auth.enabled"
+           value = "true"
        }

+       set_sensitive {
+           name  = "mongodb.auth.rootPassword"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "mongodb.auth.rootUser"
+           value = (sensitive value)
        }
    }

  # helm_release.cluster-issuer will be created
+   resource "helm_release" "cluster-issuer" {
+       atomic                     = false
+       chart                      = "../charts/cluster-issuer"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cluster-issuer"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "0.0.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set_sensitive {
+           name  = "zerossl_eab_hmac_key"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_eab_hmac_key_id"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_email"
+           value = (sensitive value)
        }
    }

  # helm_release.external-dns will be created
+   resource "helm_release" "external-dns" {
+       atomic                     = false
+       chart                      = "external-dns"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "external-dns"
+       namespace                  = "dns"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.bitnami.com/bitnami"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "6.9.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "domainFilters"
+           value = "{wayofthesys.com}"
        }
+       set {
+           name  = "google.serviceAccountSecret"
+           value = "external-dns"
        }
+       set {
+           name  = "policy"
+           value = "sync"
        }
+       set {
+           name  = "provider"
+           value = "google"
        }
+       set {
+           name  = "rbac.create"
+           value = "true"
        }
+       set {
+           name  = "sources"
+           value = "{ingress,service}"
        }
    }

  # helm_release.nginx-ingress-chart will be created
+   resource "helm_release" "nginx-ingress-chart" {
+       atomic                     = false
+       chart                      = "nginx-ingress-controller"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "nginx-ingress-controller"
+       namespace                  = "default"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.bitnami.com/bitnami"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "9.3.11"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubernetes_ingress_v1.cinema["wayofthesys.com"] will be created
+   resource "kubernetes_ingress_v1" "cinema" {
+       id     = (known after apply)
+       status = (known after apply)

+       metadata {
+           annotations      = {
+               "cert-manager.io/cluster-issuer"       = "zerossl"
+               "ingress.kubernetes.io/rewrite-target" = "/"
+               "kubernetes.io/ingress.class"          = "nginx"
            }
+           generation       = (known after apply)
+           name             = "wayofthesys.com-cinema-ingress"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {

+           rule {
+               host = "wayofthesys.com"

+               http {
+                   path {
+                       path      = "/"
+                       path_type = "ImplementationSpecific"

+                       backend {

+                           service {
+                               name = "cinema-website"

+                               port {
+                                   number = 80
                                }
                            }
                        }
                    }
                }
            }

+           tls {
+               hosts       = [
+                   "wayofthesys.com",
                ]
+               secret_name = "wayofthesys-com-cinema-tls"
            }
        }
    }

  # kubernetes_namespace.cinema will be created
+   resource "kubernetes_namespace" "cinema" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.external-dns will be created
+   resource "kubernetes_namespace" "external-dns" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.external-dns-credentials will be created
+   resource "kubernetes_secret" "external-dns-credentials" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           namespace        = "dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.mongodb-auth will be created
+   resource "kubernetes_secret" "mongodb-auth" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mongodb-auth"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.tls will be created
+   resource "kubernetes_secret" "tls" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-com-cinema-tls"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key-id"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "terrateam-362405"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_feature.mesh[0] will be created
+   resource "google_gke_hub_feature" "mesh" {
+       create_time    = (known after apply)
+       delete_time    = (known after apply)
+       id             = (known after apply)
+       location       = "global"
+       name           = "servicemesh"
+       project        = "terrateam-362405"
+       resource_state = (known after apply)
+       state          = (known after apply)
+       update_time    = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] will be created
+   resource "google_gke_hub_membership" "membership" {
+       id            = (known after apply)
+       membership_id = (known after apply)
+       name          = (known after apply)
+       project       = "terrateam-362405"

+       endpoint {
+           gke_cluster {
+               resource_link = (known after apply)
            }
        }
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.gke-cinema.google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr           = (known after apply)
+       datapath_provider           = (known after apply)
+       default_max_pods_per_node   = 65
+       enable_binary_authorization = false
+       enable_intranode_visibility = (known after apply)
+       enable_kubernetes_alpha     = false
+       enable_legacy_abac          = false
+       enable_shielded_nodes       = true
+       endpoint                    = (known after apply)
+       id                          = (known after apply)
+       label_fingerprint           = (known after apply)
+       location                    = "us-central1"
+       logging_service             = "logging.googleapis.com/kubernetes"
+       master_version              = (known after apply)
+       min_master_version          = "1.24.3-gke.2100"
+       monitoring_service          = "monitoring.googleapis.com/kubernetes"
+       name                        = "cinema"
+       network                     = "projects/terrateam-362405/global/networks/cinema"
+       networking_mode             = (known after apply)
+       node_locations              = [
+           "us-central1-a",
+           "us-central1-b",
        ]
+       node_version                = (known after apply)
+       operation                   = (known after apply)
+       private_ipv6_google_access  = (known after apply)
+       project                     = "terrateam-362405"
+       remove_default_node_pool    = true
+       resource_labels             = {
+           "mesh_id" = "proj-1037290380438"
        }
+       self_link                   = (known after apply)
+       services_ipv4_cidr          = (known after apply)
+       subnetwork                  = "projects/terrateam-362405/regions/us-central1/subnetworks/prod"
+       tpu_ipv4_cidr_block         = (known after apply)

+       addons_config {
+           cloudrun_config {
+               disabled           = (known after apply)
+               load_balancer_type = (known after apply)
            }

+           dns_cache_config {
+               enabled = false
            }

+           gce_persistent_disk_csi_driver_config {
+               enabled = (known after apply)
            }

+           gcp_filestore_csi_driver_config {
+               enabled = false
            }

+           horizontal_pod_autoscaling {
+               disabled = false
            }

+           http_load_balancing {
+               disabled = false
            }

+           network_policy_config {
+               disabled = true
            }
        }

+       authenticator_groups_config {
+           security_group = (known after apply)
        }

+       cluster_autoscaling {
+           enabled = false

+           auto_provisioning_defaults {
+               boot_disk_kms_key = (known after apply)
+               image_type        = (known after apply)
+               oauth_scopes      = (known after apply)
+               service_account   = (known after apply)
            }
        }

+       confidential_nodes {
+           enabled = (known after apply)
        }

+       database_encryption {
+           state = "DECRYPTED"
        }

+       default_snat_status {
+           disabled = false
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = (known after apply)
+           cluster_secondary_range_name  = "us-central1-01-gke-01-pods"
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = "us-central1-01-gke-01-services"
        }

+       logging_config {
+           enable_components = (known after apply)
        }

+       maintenance_policy {
+           daily_maintenance_window {
+               duration   = (known after apply)
+               start_time = "05:00"
            }
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = false
            }
        }

+       mesh_certificates {
+           enable_certificates = (known after apply)
        }

+       monitoring_config {
+           enable_components = (known after apply)
        }

+       network_policy {
+           enabled = false
        }

+       node_config {
+           boot_disk_kms_key = (known after apply)
+           disk_size_gb      = (known after apply)
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = (known after apply)
+           local_ssd_count   = (known after apply)
+           machine_type      = (known after apply)
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           node_group        = (known after apply)
+           oauth_scopes      = (known after apply)
+           preemptible       = (known after apply)
+           service_account   = (known after apply)
+           spot              = (known after apply)
+           tags              = (known after apply)
+           taint             = (known after apply)

+           gcfs_config {
+               enabled = (known after apply)
            }

+           gvnic {
+               enabled = (known after apply)
            }

+           reservation_affinity {
+               consume_reservation_type = (known after apply)
+               key                      = (known after apply)
+               values                   = (known after apply)
            }

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       node_pool {
+           initial_node_count          = 0
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = "default-pool"
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           management {
+               auto_repair  = (known after apply)
+               auto_upgrade = (known after apply)
            }

+           node_config {
+               disk_size_gb      = (known after apply)
+               disk_type         = (known after apply)
+               guest_accelerator = (known after apply)
+               image_type        = "COS_CONTAINERD"
+               labels            = (known after apply)
+               local_ssd_count   = (known after apply)
+               machine_type      = "e2-highcpu-4"
+               metadata          = (known after apply)
+               min_cpu_platform  = (known after apply)
+               oauth_scopes      = (known after apply)
+               preemptible       = false
+               service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-default-pool",
                ]
+               taint             = (known after apply)

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = (known after apply)
+               max_unavailable = (known after apply)
            }
        }

+       notification_config {
+           pubsub {
+               enabled = false
            }
        }

+       release_channel {
+           channel = (known after apply)
        }

+       service_external_ips_config {
+           enabled = (known after apply)
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       vertical_pod_autoscaling {
+           enabled = false
        }

+       workload_identity_config {
+           workload_pool = "terrateam-362405.svc.id.goog"
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 4
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
+           "us-central1-b",
        ]
+       operation                   = (known after apply)
+       project                     = "terrateam-362405"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 4
+           min_node_count = 2
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 15
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 15
+           machine_type      = "e2-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = false
+           service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.external-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.external-dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/dns.admin"
    }

  # module.external-dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] will be created
+   resource "null_resource" "additional_components" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components_destroy[0] will be created
+   resource "null_resource" "additional_components_destroy" {
+       id       = (known after apply)
+       triggers = {
+           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
+   resource "null_resource" "module_depends_on" {
+       id       = (known after apply)
+       triggers = {
+           "value" = "1"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] will be created
+   resource "null_resource" "run_command" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] will be created
+   resource "null_resource" "run_destroy_command" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

Plan: 28 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
